{
  "001_flower_chafer": {
    "id": 1,
    "nama": "Flower Chafer",
    "namaIlmiah": "Oxycetonia versicolor",
    "jenis": "Insect",
    "definisi_singkat": "The pest can cause significant yield loss due to damage to reproductive organs. Adult beetles devour the flowers and buds by feeding on pollen, anthers and other reproductive parts inside the flowers. In cotton, they also attack tender bolls. They ha...",
    "gejala_lengkap": "The pest can cause significant yield loss due to damage to reproductive organs. Adult beetles devour the flowers and buds by feeding on pollen, anthers and other reproductive parts inside the flowers. In cotton, they also attack tender bolls. They have also been observed chewing the tender shoots of eggplant crops and other tender tissue of their hosts, especially in the immature phase.",
    "penyebab_lengkap": "Damage is caused by the chafer adults. Flower chafers are day-flying beetles and mainly pollen feeders. The grubs develop in organic matter in the soil, and some infest roots, but without causing serious damage to the crop. The adults measure 7 – 15 mm in length and 5 – 7 mm in breadth. The two sexes are alike. The body is compact and oval, usually somewhat flattened, brilliantly coloured and mostly brick red with black and white markings.",
    "rekomendasi": "There are no known biological treatments at the moment. Always consider an integrated approach with preventive measures along with biological treatments, if available. There are no known chemical treatments at the moment. Always consider an integrated approach with preventive measures along with bio..."
  },
  "002_boron_deficiency": {
    "id": 2,
    "nama": "Boron Deficiency",
    "namaIlmiah": "Boron Deficiency",
    "jenis": "Deficiency",
    "definisi_singkat": "Symptoms are variable, depending on the crop and the growing conditions, but generally, they are visible first on new growth. The first sign is usually the discoloration and thickening of young leaves. Yellowing may be uniform, or diffusely intervein...",
    "gejala_lengkap": "Symptoms are variable, depending on the crop and the growing conditions, but generally, they are visible first on new growth. The first sign is usually the discoloration and thickening of young leaves. Yellowing may be uniform, or diffusely interveinal, fading gradually with distance from the main veins. Leaves and stems near the shoot tip are brittle and break easily when bent. Leaves may become puckered (slightly raised in interveinal zones) and the tip and lateral lobes may curl down. In some cases, the leaf veins may appear thickened and raised and petioles may twist. Internodes may be shortened, producing a higher density of leaves near the apex. At greater severity, the deficiency causes necrosis of the growing points. Storage roots are often short and blunt-ended and may split as the deficiency progresses.",
    "penyebab_lengkap": "Boron deficiency is usually observed in soils with a high pH because in these conditions this element is in a chemical form that is not available for the plant. Soils with low organic matter content (<1.5%) or sandy soils (prone to nutrient leaching) are also susceptible to boron deficiency. The application of boron may not correct the deficiency in those cases because it may remain unavailable for plant absorption. Symptoms on foliage might resemble those of other pathologies: false spider mite, zinc deficiency or mild iron deficiency. On storage roots, blister-like bumps and cracking can also be symptoms of root-knot nematode or rapid changes in soil moisture. Calcium deficiency may also result in the death of shoot and root tips, but young leaves below the shoot tip are not thickened and do not develop interveinal yellowing.",
    "rekomendasi": "Make sure to have healthy soils with good organic matter content and a good water retention capacity by applying farm manure. Use fertilizers containing boron (B).\nExample: disodium octaborate tetrahydrate (Boron 20%) for foliar spray.\nConsult your agricultural advisor to know the best product and d..."
  },
  "003_maize_chlorotic_mottle_virus": {
    "id": 3,
    "nama": "Maize Chlorotic Mottle Virus",
    "namaIlmiah": "MCMV",
    "jenis": "Virus",
    "definisi_singkat": "Fertilize with the right fertilizer mixture and a balanced nutrient supply. Do not over-water the crop during the season. Do not touch healthy plants after touching infected plants. Maintain a high number of different varieties of plants around field...",
    "gejala_lengkap": "Fertilize with the right fertilizer mixture and a balanced nutrient supply. Do not over-water the crop during the season. Do not touch healthy plants after touching infected plants. Maintain a high number of different varieties of plants around fields. If treating against an infestation, use specific products that do not affect beneficial insects. Remove diseased leaves, fruit or branches at the right time during the growing season. After the harvest, clean up plant debris from the field or orchard and burn them. In case of pests and diseases, always consider an integrated approach with preventive measures together with biological treatments if available. As long as preventive measures are followed and care is taken to give plants and trees what they need, no chemical control should be needed!",
    "penyebab_lengkap": ".",
    "rekomendasi": ". . ."
  },
  "004_bagrada_bug": {
    "id": 4,
    "nama": "Bagrada Bug",
    "namaIlmiah": "Bagrada hilaris",
    "jenis": "Insect",
    "definisi_singkat": "Leaf variegation shows as uneven white to yellow discoloration of portions of leaves and sometimes stems. Tissues with normal green color are adjacent, resulting in a distinct mosaic, patchy or linear pattern. Sometimes venal variegation occurs, that...",
    "gejala_lengkap": "Leaf variegation shows as uneven white to yellow discoloration of portions of leaves and sometimes stems. Tissues with normal green color are adjacent, resulting in a distinct mosaic, patchy or linear pattern. Sometimes venal variegation occurs, that is, the veins are discolored while the rest of the leaf tissue is dark green. If large parts of the plant are affected, the lack of chlorophyll can lead to stunted growth. However, in most cases the deficiency only affects a small percentage of a field and does not affect yields.",
    "penyebab_lengkap": "Leaf variegation is a genetic or physiologic abnormality that is independent of environmental conditions, that is, no pathogen is involved. The main cause of leaf variegation is the lack of the pigment chlorophyll in some portions of the leaf tissues. It occurs on a small scale in nature and does not pose any threat to plants or yields. However, some ornamental and garden plants are naturally variegated, and it is part of their beauty.",
    "rekomendasi": "As there is no direct environmental cause for this disorder, no biological treatment are available to treat it. Always consider an integrated approach with preventive measures and biological treatments if available. Leaf variegation is a genetic or physiologic disorder and as such there are no chemi..."
  },
  "005_spotted_stemborer": {
    "id": 5,
    "nama": "Spotted Stemborer",
    "namaIlmiah": "Chilo partellus",
    "jenis": "Insect",
    "definisi_singkat": "Symptoms vary in severity depending on the different hybrids/varieties and the stage at which the plant is infected. The disease is characterized by the presence of numerous, minute yellow specks and streaks that run parallel to the veins on leaves. ...",
    "gejala_lengkap": "Symptoms vary in severity depending on the different hybrids/varieties and the stage at which the plant is infected. The disease is characterized by the presence of numerous, minute yellow specks and streaks that run parallel to the veins on leaves. As they grow and coalesce, they produce long stripes, bands or blotches of chlorotic tissue, finally resulting in the death of the leaf. Plant have a stunted appearance, with short internodes. Male inflorescences are deformed, with short rachis and few spikelets. In particularly susceptible plants or in case of early infection, ears do not develop properly and there are fewer of them per plant.",
    "penyebab_lengkap": "The symptoms are caused by a virus (MCMV) that can be transmitted by several types of insects: leafhoppers, beetles and also probably some species of mites (Tetranychus spp.) and thrips (Frankliniella spp.). MCMV is generally introduced into new maize-growing regions via infected plant material. Once present, it is transmitted persistently to healthy maize plants by the feeding of the insects mentioned above. It can also overwinter in their larval stages when maize plants are not at hand. It is not thought to be seedborne. However transmission through mechanical wounds is possible. High temperature, plant stress and long periods of wet weather favor the development of the disease.",
    "rekomendasi": "There is no direct control of diseases caused by viruses. To prevent the incidence of this virus, the best method is to use resistant varieties. Please check the database for the biological control of beetles, thrips or mite that can serve as vector for this virus. Always consider an integrated appr..."
  },
  "006_cucumber_beetle": {
    "id": 6,
    "nama": "Cucumber Beetle",
    "namaIlmiah": "Diabrotica spp.",
    "jenis": "Insect",
    "definisi_singkat": "Leaves, stems, flowers show feeding damage. Feeding by the adult leaves white scars on both sides of the leaves. Thinner leaves may develop papery, whitish patches. Infected plants show signs of wilting, yellowing, and drying of the leaves. The growi...",
    "gejala_lengkap": "Leaves, stems, flowers show feeding damage. Feeding by the adult leaves white scars on both sides of the leaves. Thinner leaves may develop papery, whitish patches. Infected plants show signs of wilting, yellowing, and drying of the leaves. The growing points of the plant can die, and young plants may succumb to the attack, resulting in death. The damage can also affect harvested crops. These crops can grow small, unmarketable heads or no heads at all (referred to as \"blind\" plants). Both adult bugs and nymphs extract sap from all plant parts. The adults also release a sticky substance that spoils the crop.",
    "penyebab_lengkap": "The damage is caused by the adults and the juvenile form (nymph) of Bagrada hilaris, otherwise known as Bagrada or Painted bug. The adult insect is black and has white and orange markings on its body, which is shaped like a shield. It measures about 5-7 millimeters. The insects lay their eggs in groups on leaves or in the soil near the plants. Initially, the young insects have no wings and are bright orange. As they grow, they turn red and develop dark markings until they look like the adult form. The insects mainly affect plants from the Brassica family, such as cabbage, cauliflower, and kale. These plants often suffer from heat and lack of water. The bugs harm the plants by sucking the sap from the leaves and infesting them in large numbers.",
    "rekomendasi": "Several insects can parasitise the eggs of Bagrada hilaris, like Gryon, Ooencyyrtus, Telenomus and Trissolcus. The adult bugs are parasitised by flies and spiders. Soap solution sprays have also been found effective against the pest. Mix chilli, soap, garlic and paraffin and spray it on your crops. ..."
  },
  "007_iron_deficiency": {
    "id": 7,
    "nama": "Iron Deficiency",
    "namaIlmiah": "Iron Deficiency",
    "jenis": "Deficiency",
    "definisi_singkat": "Leaves develop interveinal chlorosis or mottling, turning the tissue between veins yellow. During later stages, the leaf margins become yellow while the leaf veins remain green. Gradually, leaves dry up and may drop within two to five days, giving th...",
    "gejala_lengkap": "Leaves develop interveinal chlorosis or mottling, turning the tissue between veins yellow. During later stages, the leaf margins become yellow while the leaf veins remain green. Gradually, leaves dry up and may drop within two to five days, giving them a 'paper bag'-like appearance.",
    "penyebab_lengkap": "The symptoms depend on the product used, dosage and time of application. The damage is caused by group C herbicides, such as atrazine, bromoxynil, diuron, and fluometuron. Due to their rapid and harmful effect on leaves, they are often qualified as 'bleachers'. They block photosynthesis and destroy the green pigments contained in the cells, discolouring them. Older leaves are more affected than younger leaves. Symptoms develop most rapidly in full sunlight. Problems with development of resistance are common in several types of weeds (grasses, mustard, stinging nettle and wild radish, for example).",
    "rekomendasi": "There are no biological control solutions for the damage. Prevention and good farming practices are the keys to avoiding harm in the first place. Always consider an integrated approach with preventive measures and biological treatments, if available. Before planning a herbicide spray, be sure that y..."
  },
  "008_downy_mildew_of_maize": {
    "id": 8,
    "nama": "Downy Mildew of Maize",
    "namaIlmiah": "Peronosclerospora sorghi",
    "jenis": "Fungus",
    "definisi_singkat": "Young caterpillars of spotted stem borer feed on tender tissues of the plants. They bore tunnels into the leaves and whorls, leaving irregular scars, holes and windows. The older larvae tunnel the stems and feed on the internal tissues, hindering the...",
    "gejala_lengkap": "Young caterpillars of spotted stem borer feed on tender tissues of the plants. They bore tunnels into the leaves and whorls, leaving irregular scars, holes and windows. The older larvae tunnel the stems and feed on the internal tissues, hindering the transport of water and nutrients. This feeding activity leads to the so-called 'dead heart' symptom where the stem is hollow and only caterpillars and their frass can be observed inside. The upper part of the plants dries up partly or entirely. Early attacked plants are stunted in growth and may lodge. Older caterpillars also tunnel extensively in cobs. Overall, the feeding activity increases the incidence and severity of fungal or bacterial diseases.",
    "penyebab_lengkap": "Adult moths are light brown and have a wingspan of 20-25mm. The forewings are light brown with some darker patterns while the hindwings are white. Adults are active at night and rest on plants and plant debris during the day. Females lay creamy white eggs in batches of 10-80 eggs onto the surface of the leaf. Caterpillars have a reddish-brown head and a light brown body with darker stripes running longitudinally and dark spots along the back, hence the name. The range of host plants is wide and includes sorghum, millet and maize. Climate conditions significantly impact the moths' life cycle. Warm and relatively humid conditions are particularly favorable. The pest most commonly occurs in hot lowland areas, and seldom above altitudes of 1500 m.",
    "rekomendasi": "Preparations based on Bacillus thuringiensis, neem oil extracts or Beauvaria bassiana have been used to control the pest. Plants such as molasses grass (Melinis minutiflora) or greenleaf desmodium (Desmodium intortum) produce volatile agents that repel the moths. Parasitoid wasps Cotesia sesamiae, C..."
  },
  "009_maize_bushy_stunt_phytoplasma": {
    "id": 9,
    "nama": "Maize Bushy Stunt Phytoplasma",
    "namaIlmiah": "Phytoplasma asteris",
    "jenis": "Bacteria",
    "definisi_singkat": "Adults feed mainly on foliage and flowers, interfering with pollination and grain/pod/fruit development. Larvae feed on root hairs, roots and stems, reducing the ability of the plant to absorb water and nutrients from the soil. Root tips may be chewe...",
    "gejala_lengkap": "Adults feed mainly on foliage and flowers, interfering with pollination and grain/pod/fruit development. Larvae feed on root hairs, roots and stems, reducing the ability of the plant to absorb water and nutrients from the soil. Root tips may be chewed back to the base of the plant or appear brown and bored with tunnels. Symptoms show as drought or nutrient deficiencies. At later stages of plant growth, the damage to the root can weaken the stalk and lead to harvesting difficulties due to plant lodging. Damage by larvae also favors opportunistic pathogens. Moreover, some species of Diabrotica are vectors for the maize chlorotic mottle virus and the bacteria that cause bacterial wilt. This can lead to more yield losses.",
    "penyebab_lengkap": "Diabrotica species are a group of insect pests that attack several crops of agricultural importance including common beans and maize. Cucumber beetles are usually yellow-green colored and are divided in two groups depending on their aspects. The first group have three black stripes down the back, while the second one is characterized by twelve black spots on the back. The adults overwinter in surrounding areas and become active in mid-spring, when temperatures begin to rise. Females deposit eggs in clusters in soil cracks near their host plants. The larvae feed in and on the roots first, later also on the shoot while adults feed on foliage, pollen and flowers. The development from egg to adult takes about a month, depending on environmental conditions. As temperatures increase, development time decreases. Cucumber beetles like moist areas with good water supply and dislike heat.",
    "rekomendasi": "Several species of nematodes, predators (mites, insects) and parasitoids flies and wasps can be used to control the population. For example, the tachinid fly Celatoria diabroticae can be introduced when the population of the cucumber beetle is not that large. The fungi Beauveria bassiana and Metarhi..."
  },
  "010_tobacco_caterpillar": {
    "id": 10,
    "nama": "Tobacco Caterpillar",
    "namaIlmiah": "Spodoptera litura",
    "jenis": "Insect",
    "definisi_singkat": "Symptoms of iron deficiency first appear in the youngest leaves. It is characterized by the yellowing (chlorosis) of upper leaves, with the midrib and leaf veins remaining clearly green (interveinal chlorosis). At later stages, if no measures are tak...",
    "gejala_lengkap": "Symptoms of iron deficiency first appear in the youngest leaves. It is characterized by the yellowing (chlorosis) of upper leaves, with the midrib and leaf veins remaining clearly green (interveinal chlorosis). At later stages, if no measures are taken, the whole leaf turns whitish-yellow and brown necrotic spots start to appear on the leaf blade, often leading to the development of necrotic patches on the margins. Affected areas can easily be identified from a distance in the field. Plants with iron deficiency are stunted in growth and potentially produce lower yields.",
    "penyebab_lengkap": "Iron deficiency can be a serious problem in leached tropical soils or in poorly drained soils, mostly under cool, damp springs. Sorghum, corn, potatoes, and beans are the most severely affected crops whereas wheat and alfalfa are the least sensitive. Calcareous, alkaline soils (pH 7.5 or higher) derived from limestone make plants especially prone to iron deficiency. Iron is important for photosynthesis and for the development and maintenance of root nodules in legumes. Therefore, iron deficiency severely depresses nodule mass, nitrogen fixation, and crop yield. The estimated critical level is around 2.5 mg/kg of plant dry tissue. The deficiency of iron also increases the uptake and accumulation of cadmium in plants.",
    "rekomendasi": "Smallholders may use a leaf fertiliser made of nettle slag and algae extract. Application of animal manure, peat and composts also add iron to the soil. Plant dandelions in the proximity of your crops, since they make iron available to nearby crops, especially trees. Use fertilisers containing iron ..."
  },
  "011_sooty_mold": {
    "id": 11,
    "nama": "Sooty Mold",
    "namaIlmiah": "Pezizomycotina",
    "jenis": "Fungus",
    "definisi_singkat": "Also called phytotoxicity, the symptoms are caused by the misuse or misapplication of chemicals on plants. Symptoms included leaf spots, necrotic blotches, scorch of the margins and tip burn and can sometimes be confused with disease, insect or mite ...",
    "gejala_lengkap": "Also called phytotoxicity, the symptoms are caused by the misuse or misapplication of chemicals on plants. Symptoms included leaf spots, necrotic blotches, scorch of the margins and tip burn and can sometimes be confused with disease, insect or mite damage or other pathologies caused by environmental conditions. Damage may also occur due to wind drift onto non-target or sensitive plants. Phytotoxicity may also result when incompatible chemicals are applied at the same time.",
    "penyebab_lengkap": "Phytotoxicity frequently occurs when pesticides are sprayed under adverse environmental conditions for the plant. High temperatures and humidity in general will increase the possibility of injury from pesticides (insecticides and fungicides; especially soaps, oils and sulfur compounds). Cool damp weather in turn may increase the chance of injury by copper fungicides. Spray applications should be applied during calm, dry and cool conditions. Most pesticides are best applied below 25°C. Environmental of biotic stress (drought, insect injury) predispose plants to chemical damage. Hot, humid, and overcast weather, leading to poor drying conditions can also make plants that are otherwise resistant much more susceptible.",
    "rekomendasi": "When insects or diseases seriously damage vegetable plants, sometimes it is best to cut off the damaged parts or re-plant and learn how to prevent the problem next time. Always consider an integrated approach with preventive measures and biological treatments if available. There are no chemical cont..."
  },
  "012_fruit_molds": {
    "id": 12,
    "nama": "Fruit Molds",
    "namaIlmiah": "Aspergillus spp.",
    "jenis": "Fungus",
    "definisi_singkat": "If humid conditions prevail during the maturation period of the fruit, several fungi can colonize and decay pistachio fruits. This is mainly denoted by a discoloration of the shell and, in some cases, the production of odorless and colorless aflatoxi...",
    "gejala_lengkap": "If humid conditions prevail during the maturation period of the fruit, several fungi can colonize and decay pistachio fruits. This is mainly denoted by a discoloration of the shell and, in some cases, the production of odorless and colorless aflatoxins. Depending on the degree of colonization or the type of fungus, the discoloration and decay will be more or less pronounced. Usually, the hulls turn light beige to yellow or brown. Under the hulls, signs of fungal growth are visible on the shells, which may be stained. Hulls often adhere to shells. Dehiscent fruits and those attacked by insects are particularly affected.",
    "penyebab_lengkap": "Fruit rot in Pistachio is caused by several species of Aspergillus, but also by some species of Penicillium, Stemphylium or Fusarium. The disease is often associated with insect infestations, particularly the pistachio seed chalcid (Megastigmus pistaciae) and the pistachio seed wasp (Eurytoma plotnikovi). The holes created by these pests facilitate the penetration of the fungi. High temperatures, wet and humid conditions during the maturation period favor the disease, although infection by Aspergillus spp. can occur under drier than normal conditions. Darkness and lack of aeration are also factors contributing to the spread of the disease. Lack of water in late spring and early summer can increase the number of dehiscent fruits, and thereby favor the disease cycle.",
    "rekomendasi": "There are no very effective biological treatments for the disease. However, copper-based biological fungicides have shown acceptable efficacy when applied under favorable climatic conditions. Always consider an integrated approach that combines preventative measures with biological treatments if ava..."
  },
  "013_nitrogen_deficiency": {
    "id": 13,
    "nama": "Nitrogen Deficiency",
    "namaIlmiah": "Nitrogen Deficiency",
    "jenis": "Deficiency",
    "definisi_singkat": "The formation of white downy growth occurs on both the upper and lower surface of the leaves. Shortening of internodes leads to the stunted and bushy appearance of the plants. A downy growth also occurs on bracts of green unopened male flowers in the...",
    "gejala_lengkap": "The formation of white downy growth occurs on both the upper and lower surface of the leaves. Shortening of internodes leads to the stunted and bushy appearance of the plants. A downy growth also occurs on bracts of green unopened male flowers in the tassel. Small to large leaves are noticed in the tassel.",
    "penyebab_lengkap": "The damage is caused by the fungus, which grows as white downy growth on both surfaces of the leaves. The primary source of infection is through oospores in the soil and due to dormant mycelium present in the infected maize seeds. Once the fungus colonises the host tissue, sporangiophores emerge from stomata and produce conidia which are spread by rain and wind splash causing secondary infections.",
    "rekomendasi": "Grow resistant varieties and hybrids. Always consider an integrated approach with preventive measures and available biological treatments. Treat seeds with systemic fungicides containing active ingredients like metalaxyl and mancozeb. Always consider an integrated approach with preventive measures a..."
  },
  "014_maize_smut": {
    "id": 14,
    "nama": "Maize Smut",
    "namaIlmiah": "Ustilago maydis",
    "jenis": "Fungus",
    "definisi_singkat": "Severity of symptoms depends on the variety of maize plant and the stage of infection. Usually, a yellowing of the margins of whorl leaves and a red coloration of older leaves are the first signs of an infection by P. asteris in maize. These symptoms...",
    "gejala_lengkap": "Severity of symptoms depends on the variety of maize plant and the stage of infection. Usually, a yellowing of the margins of whorl leaves and a red coloration of older leaves are the first signs of an infection by P. asteris in maize. These symptoms intensify as the disease progresses, and eventually the margins of leaves frequently acquire a torn or tattered appearance. The plant displays a bushy appearance as lots of additional ear shoots and tillers appear. Shortening of the internodes and stunting become apparent. Male inflorescences are often either not formed or are barren. Plants have either no ears or a proliferation of ears, which produce little or no grains.",
    "penyebab_lengkap": "The symptoms are caused by the bacterium Phytoplasma asteris, a pathogen of maize that is spread naturally by several leafhoppers, among others Macrosteles quadrilineatus. It is also transmitted via infected plant material (seedlings or grafts), but not by seeds. These leafhoppers can also pass on the pathogens to a number of host plants, among others the parasitic \"dodder\" (Cuscuta spp.). High temperatures contribute to a worsening of the symptoms, while cool weather usually results in no or little effect. Early infections are also much worse in terms of symptoms and the consequences on yields.",
    "rekomendasi": "Bioinsecticides based on the parasitic fungi Metarhizium anisopliae, Beauveria bassiana, Paecilomyces fumosoroseus and Verticillium lecanii may be used to control the population of leafhoppers. Parasitic insect species such as Anagrus atomus may also be used for this purpose. Beneficial insects such..."
  },
  "015_fall_armyworm": {
    "id": 15,
    "nama": "Fall Armyworm",
    "namaIlmiah": "Spodoptera frugiperda",
    "jenis": "Insect",
    "definisi_singkat": "Feeding damage becomes apparent on the leaves. Larvae are scraping the leaf tissue, creating large, irregular shaped holes. It can result in complete defoliation of the plant. Flower buds and pods are also attacked and show feeding holes. In lighter ...",
    "gejala_lengkap": "Feeding damage becomes apparent on the leaves. Larvae are scraping the leaf tissue, creating large, irregular shaped holes. It can result in complete defoliation of the plant. Flower buds and pods are also attacked and show feeding holes. In lighter soils also the roots become damaged. Due to extensive feeding, only petioles and branches are left behind.",
    "penyebab_lengkap": "Symptoms are caused by the larvae of Spodotpera litura. Adult moths have grayish-brown bodies and variegated forewings with white wavy markings on the edges. The hindwings are translucent white with brown lines along the margins and the veins. Females lay hundreds of eggs in clusters on the upper leaf blades, covered with golden brown scales. After hatching, the hairless light-green larvae disperse quickly and start feeding gregariously on leaves. Older larvae are dark green to brown with dark spots on the flanks and somewhat clearer bellies. Two yellow longitudinal bands run along the sides, interrupted by black triangular spots. An orange band runs dorsally between these spots. Larvae feed during the night and take refuge in the soil during the day. Larvae and adults thrive at temperatures between 15°C and 35°C, optimum at 25 °C. Low humidity and higher or lower temperatures reduce fertility and prolong their life cycle.",
    "rekomendasi": "Bioinsecticides based on Nuclear Polyhedrosis Virus (NPV) or Bacillus thuringiensis can be used on eggs and larvae. Bait solutions based on rice bran, molasses or brown sugar can be distributed on the soil in the evening hours. Plant oil extracts of neem leaves or kernels and extracts of Pongamia gl..."
  },
  "016_stunt_of_maize": {
    "id": 16,
    "nama": "Stunt of Maize",
    "namaIlmiah": "Spiroplasma kunkelii",
    "jenis": "Bacteria",
    "definisi_singkat": "Sooty mold can be found on mango trees and any other plants that have previously been fed upon by insects. The mold grows on honeydew, a sticky, sugary secretion that is produced by some insects to attract fellow bugs. Using the honeydew as a food so...",
    "gejala_lengkap": "Sooty mold can be found on mango trees and any other plants that have previously been fed upon by insects. The mold grows on honeydew, a sticky, sugary secretion that is produced by some insects to attract fellow bugs. Using the honeydew as a food source, the mold gradually covers the surface of the affected plant part, coloring it in various shades of black. Sooty molds are non-parasitic and non-pathogenic fungi, so they do not colonize plant tissues or trigger symptoms. However, they alter the ability of the plant to perform photosynthesis and to exchange gases with the atmosphere. Severely infected leaves may die and fall off, thereby affecting the plants growth and survival.",
    "penyebab_lengkap": "Phloem-feeding insects like the mango leafhopper (Amritodus atkinsoni), whiteflies, aphids and many others are associated with the disease as they feed on plant sap. In the process of feeding, honeydew is secreted on the surface of the plant, thereby creating the perfect medium for sooty mold to grow on. Honeydew can drip down on neighboring leaves or plants, thus spreading the fungus further. The fungi survive as mold or as spores on plant parts, tools or transport vehicles. Insects also spread the mold from plant to plant. Ants, for example, tend to protect the sooty mold colonies for their own benefit.",
    "rekomendasi": "Use formulations of neem oil, which is an organic broad spectrum compound, to ward off whiteflies, aphids, scales, ants, and mealy bugs. Neem oil also reduces the growth of the fungus itself. Insecticidal soap or dish soap (e.g. one tablespoon per 5 liters of water) can be sprayed on affected plants..."
  },
  "017_termites": {
    "id": 17,
    "nama": "Termites",
    "namaIlmiah": "Termitidae",
    "jenis": "Insect",
    "definisi_singkat": "The infestation can occur during the vegetative growing stage, the flowering stage and also after harvesting. Typically, the adult moths are attracted to damaged and stressed plants. Feeding damage is only due to the larvae, which normally feed on ro...",
    "gejala_lengkap": "The infestation can occur during the vegetative growing stage, the flowering stage and also after harvesting. Typically, the adult moths are attracted to damaged and stressed plants. Feeding damage is only due to the larvae, which normally feed on rotting plant material. Having eaten up the residues, they start to feed on the healthy plant material (roots, stems, pseudostems, stalks and fruits). Seeds can be attacked, too. Initial symptoms appear as tunnels, but it is very difficult to spot them in the early stages. Most commonly, the pest is detected at later stages. The fleshy plant parts can be entirely hollowed out and leaves appear wilted. In adverse conditions this might result in defoliation and collapse of the plant.",
    "penyebab_lengkap": "The symptoms are caused by the larvae of the species Opogona sacchari. The moths are nocturnal. They have a bright brown body, are about 11 mm in size and have a wing span of 18-25 mm. Forewings are of an homogeneous brown, with sometimes a long darker banding and males have a dark brown spot on them. The back wings are gray and brighter, with fringes in the margins. The female moth lays around 50-200 eggs in groups of about 5 into wounds and cracks of the plant tissue. After about 12 days the white or pale green, slightly transparent larvae hatch. The larvae have a bright reddish to brown head with an eye-like mark on both sides. The larvae grow to about 26 mm within about 50 days. Then they pupate at the end of the feeding tunnels. After an additional 20 days, the new generation of adult moths hatch. The development is strongly favored in cool temperatures (about 15°C) and dry weather. This period may be reduced under warmer weather conditions.",
    "rekomendasi": "In greenhouse experiments, the use of nematodes such as Steinernema feltiae, Heterorhabditis bacterophora and Heterorhabditis heliothidis was effective against the larvae. Also bacillus thuringiensis products can be used. Always consider an integrated approach with preventive measures together with ..."
  },
  "018_brown_stink_bug": {
    "id": 18,
    "nama": "Brown Stink Bug",
    "namaIlmiah": "Euschistus servus",
    "jenis": "Insect",
    "definisi_singkat": "Usually the first noticeable sign of an infection by S. kunkelii is the wilting of leaves and the yellowing of their margins. This is followed by the reddening of older leaves, starting from the tip and later extending to the rest of the tissue. Some...",
    "gejala_lengkap": "Usually the first noticeable sign of an infection by S. kunkelii is the wilting of leaves and the yellowing of their margins. This is followed by the reddening of older leaves, starting from the tip and later extending to the rest of the tissue. Some 2-4 days after the appearance of these symptoms, small chlorotic spots appear at the base of young developing leaves. As they grow, these spots coalesce and turn into stripes that run along the veins, often up to the tip. Plants infected at early stages are severely stunted, with twisted and distorted leaves and very short internodes. Multiple ear shoots and new tillers may develop, sometimes as many as 6-7 on a single plant, giving it a bushy appearance. Ears are smaller than usual and do not fill properly, often with loose grains.",
    "penyebab_lengkap": "Symptoms will depend on the variety of maize and the altitude. They are caused by Spiroplasma kunkelii, a bacterial-like organism that only infects maize plants. A number of leafhoppers, e.g. Dalbulus maidis, D. eliminatus, Exitianus exitiosus, Graminella nigrifons and Stirellus bicolor may carry this pathogen during their overwintering period. When they emerge in early spring, they start to feed on plants and transmit the pathogen. Disease symptoms usually appear about 3 weeks after the maize plant is first infected. Not surprisingly, the disease is most severe during the summer season, when leafhopper populations are very high. However, it can also occur in maize planted in spring.",
    "rekomendasi": "There is no direct biological treatment to control S. kunkelii. Some bioinsecticides containing parasitic fungi species such as Metarhizium anisopliae, Beauveria bassiana, Paecilomyces fumosoroseus and Verticillium lecanii can be used to control acute infestation of planthoppers. Always plan an inte..."
  },
  "019_sugarcane_pyrilla": {
    "id": 19,
    "nama": "Sugarcane Pyrilla",
    "namaIlmiah": "Pyrilla perpusilla",
    "jenis": "Insect",
    "definisi_singkat": "Termites can attack plants at all growth stages, from seedlings to mature plants. They damage roots, shown first in the upper parts of the plant as wilting. To confirm the presence of termites, it is necessary to pull out the affected plants and exam...",
    "gejala_lengkap": "Termites can attack plants at all growth stages, from seedlings to mature plants. They damage roots, shown first in the upper parts of the plant as wilting. To confirm the presence of termites, it is necessary to pull out the affected plants and examine the roots and lower stem for live insects or the presence of tunnels. Plant roots and stems may be completely hollowed out and filled with soil waste. Some plants lodge during strong wind and they are often covered with soil, under which termites may be found. It is important to examine plants in the early morning or late evening, as termites may have moved deeper into the soil during the day when temperatures are higher.",
    "penyebab_lengkap": "Termites live in large colonies consisting of many workers, soldiers and reproductive forms. Their nests are sometimes very elaborate. Some build nests on moist dead tree stumps, while others build subterranean nests. They feed away from the nest protected through underground tunnels, on plant roots and other material in fields. Termites may attack plants if there is no other food available, therefore ensure there is plenty of soil organic matter. The reproductive termites are winged. Numerous winged males and females, generally dark in color and with well-developed eyes, are produced for swarming. Swarming is often taking place at dusk after the onset of heavy rains. After flying, they shed off their wings, mate, and burrow into holes in the soil and cracks in wood to create a new colony.",
    "rekomendasi": "Preparations based on nematodes that attack termites are effective against this pest. Solutions containing the fungi Beauveria bassiana or some species of Metarhizium are effective when applied into the termite hill. Fungi spores can also act as repellents. Neem seed kernel extracts (NSKE) have been..."
  },
  "020_shoot_flies": {
    "id": 20,
    "nama": "Shoot Flies",
    "namaIlmiah": "Atherigona sp.",
    "jenis": "Insect",
    "definisi_singkat": "Stink bugs feed on the squares and bolls of cotton. They attack mainly older bolls which then are stained and matted superficially. Seeds of the attacked bolls are shriveled and bolls may not open. If young bolls are damaged, they may drop off. The e...",
    "gejala_lengkap": "Stink bugs feed on the squares and bolls of cotton. They attack mainly older bolls which then are stained and matted superficially. Seeds of the attacked bolls are shriveled and bolls may not open. If young bolls are damaged, they may drop off. The external lesions are associated with wart like growths on the interior of the boll, more precisely on the inner carpal wall where penetration has occurred. Seed feeding may result in reduced cotton production and stained cotton near the feeding site, which is a clear loss in terms of quality. Stink bugs are also known to facilitate the infection of opportunistic boll rotting organisms.",
    "penyebab_lengkap": "Adults overwinter in protected areas such as ditch banks, fence rows, under boards and dead weeds, ground cover, stones, and under the bark of trees. They become active during the first warm days of spring when temperatures rise above 21°C. Normally the first generation develops on wild hosts, while the second generation typically develops on cultivated crops. Each female lays about 18 egg masses, averaging 60 eggs, over a period of over 100 days. Adults are strong fliers and will readily move between weeds and other alternate hosts.",
    "rekomendasi": "Parasitic tachinid flies and wasps lay eggs into the eggs of stink bugs and their larvae later feed on the hatching maggots. Birds and spiders can also help to reduce infestation. The oil of Eucalyptus urograndis is toxic to the bugs and their nymphs. Always consider an integrated approach with prev..."
  },
  "021_foot_and_collar_rot": {
    "id": 21,
    "nama": "Foot and Collar Rot",
    "namaIlmiah": "Athelia rolfsii",
    "jenis": "Fungus",
    "definisi_singkat": "All actively growing parts of the plant can be infected with the fungus. Their predisposition to injuries and their growth potential makes them prone to show the most dramatic symptoms. Plants in the seedling stage are the most susceptible to infecti...",
    "gejala_lengkap": "All actively growing parts of the plant can be infected with the fungus. Their predisposition to injuries and their growth potential makes them prone to show the most dramatic symptoms. Plants in the seedling stage are the most susceptible to infection. In that case, plant growth is stunted and they may not produce inflorescences or ears. On older plants, the infection results in the formation of tumorous growth, a combination of host and fungal tissues. Smut galls are greenish white at their early stages and turn black as they mature. They are particularly characteristic on ears, where each single kernel can develop its own gall. As they rupture, they show a powdery black content. On leaves, the tumorous growth usually remains small and dries out without rupturing.",
    "penyebab_lengkap": "Common smut in maize is caused by the fungus Ustilago maydis, which can remain viable in the soil for several years. Spores spread onto the plants with wind, soil dust and rain splashes. The infection process is favoured by the presence of injuries, such as those inflicted by insects, animals, bad cultivation practices or hail. There is no direct secondary transmission from plant to plant. The symptoms are particularly severe in tissues with a huge growth potential (like ears or growing tips). Weather extremes that result in scanty pollen production and poor pollination rates (like a drought followed by heavy rain) are conducive to the propagation of the fungus.",
    "rekomendasi": "Direct control of the fungus is difficult and ineffective method has been developed so far against this pathogenic fungi. Alway consider an integrated approach with preventive measures together with possible biological treatments. Seed and foliar applications of fungicides do not reduce the incidenc..."
  },
  "022_maize_lethal_necrosis_disease": {
    "id": 22,
    "nama": "Maize Lethal Necrosis Disease",
    "namaIlmiah": "MLND",
    "jenis": "Virus",
    "definisi_singkat": "The pest is found on the underside of the leaves where they suck up plant sap. This causes the yellowing first and then the drying of leaves. Under low infestation, yellow patches appear on the leaf surface. Photosynthesis is reduced resulting in the...",
    "gejala_lengkap": "The pest is found on the underside of the leaves where they suck up plant sap. This causes the yellowing first and then the drying of leaves. Under low infestation, yellow patches appear on the leaf surface. Photosynthesis is reduced resulting in the stunting of the plant. Hoppers also secrete a sweet substance called honeydew that coats the leaves. This attracts opportunistic fungi whose growth blackens the leaf blade. This reduces photosynthesis even more, resulting in yield loss. Beside maize, they also readily attack sugarcane, millets, rice, barley, oats, sorghum, bajra and wild grasses.",
    "penyebab_lengkap": "Damage is caused by the adults of Pyrilla perpusilla, a very active plant hopper that breed throughout the year and may migrate from field to field, causing major damage. Adults are greenish to straw-colored and about 7-8 mm in length. They are usually found feeding gregariously on plants and jump off readily when disturbed. Their pointed snout hide the mouth parts with which they pierce and suck plant tissues. Spreading of the pest is favored by high humidity and rapid plant growth, for example in heavily manured or fertilized fields. Excess irrigation or the rainy season also contributes to its propagation.",
    "rekomendasi": "Several parasitoids attack eggs and nymphs. Egg parasitoids include Tetrastichus pyrillae, Cheiloneurus pyrillae, Ooencyrtus pyrillae, O. pipilionus and Agoniaspis pyrillae. Nymphs are attacked by Lestodryinus pyrillae, Pyrilloxenos ompactus, Chlorodryinus pallidus, Epiricania melanoleuca. Predators..."
  },
  "023_leaf_spot_of_maize": {
    "id": 23,
    "nama": "Leaf Spot of Maize",
    "namaIlmiah": "Cochliobolus lunatus",
    "jenis": "Fungus",
    "definisi_singkat": "The maggot feeds on the shoots of young growing seedlings resulting in “dead hearts” in wheat and maize. Small circular cuts are visible at the point of entrance on new shoots, usually just above the first leaf sheath. The symptoms of damage become m...",
    "gejala_lengkap": "The maggot feeds on the shoots of young growing seedlings resulting in “dead hearts” in wheat and maize. Small circular cuts are visible at the point of entrance on new shoots, usually just above the first leaf sheath. The symptoms of damage become more prominent on the emerging leaf 6-7 days after infestation. Cut leaves turn pale green or yellowish-green and droop, folding inwards from the margins. Severely infested seedlings wilt, terminal growth ceased and the plant remained stunted. Usually, only one larva is found per seedling, although more eggs may be laid by females.",
    "penyebab_lengkap": "The damage is cause by the larvae of a number of flies of the genus Atherigona. These small gray-colored flies are polyphagous and attack main crops such as wheat, maize and sorghum. Other plants, such as peppers, beans or lentils, can also be affected. Females lay eggs singly, or more rarely in pairs, on the stems or on the soil near the base of the seedlings (the 3-4-leaf stage is preferred). The application of farmyard manure to the soil seems to attract more female flies and increase ovoposition. Newly emerged larvae are cylindrical and white. They move up the plant and use their mouthhooks to masticate the tender parts of the new shoots, usually just above the first leaf sheath. Pupation usually occurred at the base of the stem. These flies can be a very damaging pests in agriculture in Central and Southeast Asia.",
    "rekomendasi": "To this day no biological control for this pest is know. Please contact us if you know of any. Always consider an integrated approach with preventive measures together with biological treatments if available. Currently the recommendations to suppress infestations in the crops are to sow early to avo..."
  },
  "024_spotted_maize_beetle": {
    "id": 24,
    "nama": "Spotted Maize Beetle",
    "namaIlmiah": "Astylus atromaculatus",
    "jenis": "Insect",
    "definisi_singkat": "Symptoms develop first in older leaves and move gradually up to the younger ones. In mild cases, the older mature leaves turn pale green. If not amended, over time a widespread yellowing develops on those leaves along with a light red discoloration o...",
    "gejala_lengkap": "Symptoms develop first in older leaves and move gradually up to the younger ones. In mild cases, the older mature leaves turn pale green. If not amended, over time a widespread yellowing develops on those leaves along with a light red discoloration of veins and petioles. As the deficiency progresses, these leaves eventually turn yellowish-white (veins included) and may curl or grow deformed. Young leaves remain pale green but grow much smaller than usual. Plants have a long, thin appearance due to the reduced branching but their height is usually normal. Plants become more susceptible to water stress and the wilting of leaves is common. Premature death and shedding may happen, which results in considerably lowered yields. Recovery becomes evident after a few days with the application of nitrogen fertilizer.",
    "penyebab_lengkap": "High rates of nitrogen are important during the vegetative growth of the plant. In periods of favorable weather, it is important to provide the fast-growing crops with a good nitrogen supply, so that they can reach their maximum vegetative and fruit/grain production potential. Nitrogen deficiencies can be observed in sandy, well-drained soils with little organic matter as they are prone to the leaching of nutrients. Frequent rainfalls, flooding or heavy irrigation wash down nitrogen into the soil and can also lead to deficiencies. Periods of drought stress hinder the absorption of water and nutrients, resulting in an unbalanced nutrient supply. Finally, the soil pH also plays a role in the availability of nitrogen to the plant. Both low or high soil pH negatively affect the absorption of nitrogen by the plant.",
    "rekomendasi": "High levels of organic matter in soils can enhance soil structure and improve the capacity of the soil to retain water and nutrients. Organic matter can be added to soils as manure, compost, peat, or simply with the addition of nettle slag, guano, horn meal or nitrolime. Nettle slag can be sprayed d..."
  },
  "025_stalk_rot_of_maize": {
    "id": 25,
    "nama": "Stalk Rot of Maize",
    "namaIlmiah": "Gibberella fujikuroi",
    "jenis": "Fungus",
    "definisi_singkat": "The fungus primarily attacks the stems, although other plant parts may be affected under favorable conditions. It grows rapidly over the plant tissue and surrounding soil forming a white, fluffy fungal mat with characteristic roundish, tan to brown \"...",
    "gejala_lengkap": "The fungus primarily attacks the stems, although other plant parts may be affected under favorable conditions. It grows rapidly over the plant tissue and surrounding soil forming a white, fluffy fungal mat with characteristic roundish, tan to brown \"seeds\". The stem tissues turn pale brown and soft, but not watery. In some cases, the stem may be completely girdled and leaves gradually start to wilt and become chlorotic. Eventually, the plant can lodge or die, and entire rows or large patches of dead plants can be observed within the field. Seedlings are particularly susceptible and die quickly once they become infected. Occasionally, fruits are also covered with the fungal mat and they rapidly decay.",
    "penyebab_lengkap": "The symptoms are caused by the fungus Athelia rolfsii, also known as Sclerotium rolfsii, thereby the common name of the disease. It overwinters in the soil or associated with plant debris. It causes disease on a wide range of agricultural and horticultural crops (lentil, sweet potato, pumpkin, corn, wheat and peanut, to name a few). In favorable conditions, it has an extremely rapid growth and can colonize plant tissues at or near the soil line in question of days. Low soil pH (3.0 to 5.0), frequent irrigation or rain, dense planting and high temperatures (25 to 35 °C) favor the life cycle of the fungus and the infection process. By contrast, calcareous soils with high pH usually do not cause problems. Dissemination depends on the movement of infested soil and water, contaminated tools and equipment, as well as infected plant and animal material (seeds and manure).",
    "rekomendasi": "Antagonistic fungi (often in combination with other treatments) can provide some control against this pathogen. Note that results depend greatly on the type of crop and the environmental conditions. Some of the commonly used organisms are Trichoderma harzianum, Trichoderma viride, Bacillus subtilis,..."
  },
  "026_northern_leaf_spot_of_maize": {
    "id": 26,
    "nama": "Northern Leaf Spot of Maize",
    "namaIlmiah": "Cochliobolus carbonum",
    "jenis": "Fungus",
    "definisi_singkat": "In early infection stages leaves show a yellow-green mottled pattern, often parallel to the veins and starting at the base. As the disease progresses, the leaves begin to dry, usually from the margins toward the midrib. In severe infections, this sym...",
    "gejala_lengkap": "In early infection stages leaves show a yellow-green mottled pattern, often parallel to the veins and starting at the base. As the disease progresses, the leaves begin to dry, usually from the margins toward the midrib. In severe infections, this symptom can gradually extend to the rest of the plant and dead hearts are visible in stems cut open. The growth of infected plants is stunted, the inflorescences are sterile, and the ears are malformed, shortened and partially filled. The affected plants are weakened and can become the target of opportunistic fungi and nematodes, leading to rots of tissues and deterioration of grain quantity and quality.",
    "penyebab_lengkap": "All maize plants are susceptible to the disease. However, the symptoms vary considerably depending on the combination of viruses present, the environmental conditions and the vegetative stage of the plant. The disease is actually caused by a combination of two viruses, the maize chlorotic mottle virus and another virus, in most cases the sugarcane mosaic virus. These infection agents are mainly spread in and between fields by vectors such as maize thrips, rootworms, and leaf beetles as well as cereal leaf beetles. The symptoms are worsened by adverse environmental conditions such as drought, poor soil fertility and inadequate agricultural practices.",
    "rekomendasi": "Sorry, we don't know any biological control measures against this disease. Always consider an integrated approach with preventive measures together with biological treatments if available. There is no chemical treatment for virus diseases. Some insecticides can be applied as a seed treatment and as ..."
  },
  "027_zinc_deficiency": {
    "id": 27,
    "nama": "Zinc Deficiency",
    "namaIlmiah": "Zinc Deficiency",
    "jenis": "Deficiency",
    "definisi_singkat": "Both adults and nymphs feed on flower buds and on closed or partially-opened cotton bolls. They bore through the fibers and feed on the seeds. The damaged tissues are colonized by microorganisms that cause boll rot and discoloration. Boll abortion, p...",
    "gejala_lengkap": "Both adults and nymphs feed on flower buds and on closed or partially-opened cotton bolls. They bore through the fibers and feed on the seeds. The damaged tissues are colonized by microorganisms that cause boll rot and discoloration. Boll abortion, premature opening and early shed are common. Further symptoms are smaller seeds with reduced oil content, stained fibers and lower germination rate. These seeds are not fit for sowing. D. cingulatus is not bound to a single plant and may migrate to other young bolls. A high infestation can cause a severe loss in quality due to the stained lint.",
    "penyebab_lengkap": "The damage is caused by the nymphs and adults of Dysdercus cingulatus. Adults may reach a length of 12-13 mm and are of a distinct red-orange color. Head is red with a white collar, abdomen is black and forewings have two black dots. Males are smaller than females. Females can lay up to 130 bright yellow eggs at a time in the soil, nearby the host plants. After an incubation period of 7-8 days, nymphs hatch and start to feed on cotton plants. They are also red and have three black dots on the abdomen and three pairs of white dorsal spots. The development period lasts 50-90 days in total, depending on the climate. Infestation occur towards the end of the season, when the first bolls are opening. Alternative hosts include okra, hibiscus and citrus.",
    "rekomendasi": "Foliar sprays with diluted neem oil have shown to be effective against this pest. Always consider an integrated approach with preventive measures and biological treatments if available. The foliar application of insecticide formulations containing chlorpyrifos, esfenvalerate or indoxacarb works agai..."
  },
  "028_damping-off_of_seedlings": {
    "id": 28,
    "nama": "Damping-Off of Seedlings",
    "namaIlmiah": "Pythium spp.",
    "jenis": "Fungus",
    "definisi_singkat": "Initially, small dead spots with light-coloured halos, which can reach up to 0.5 cm in diameter appear on leaves. Severe infection may result in the yellowing of the whole leaf. Lesions and moulds appear on seeds, ultimately resulting in seedling bli...",
    "gejala_lengkap": "Initially, small dead spots with light-coloured halos, which can reach up to 0.5 cm in diameter appear on leaves. Severe infection may result in the yellowing of the whole leaf. Lesions and moulds appear on seeds, ultimately resulting in seedling blight and seed germination failure. Leaves show abnormal colours with necrotic areas. The seeds may exhibit discolourations, lesions on seeds, mould, and rot.",
    "penyebab_lengkap": "The symptoms are caused by the fungi of C. lunatus. The infection can be caused by air bourne conidia and ascospores, rainwater splashing and irrigation, and can also survive in the soil via old crop residues. The disease is common in hot, humid areas, under an optimal temperature range of 24-30°C.",
    "rekomendasi": "To this day, we are not aware of any biological control method available against this disease. If you know of any successful method to reduce the incidence or gravity of the symptoms, please contact us. Always consider an integrated approach with preventive measures together with biological treatmen..."
  },
  "029_lesser_stalk_borer_of_maize": {
    "id": 29,
    "nama": "Lesser Stalk Borer of Maize",
    "namaIlmiah": "Elasmopalpus lignosellus",
    "jenis": "Insect",
    "definisi_singkat": "",
    "gejala_lengkap": "",
    "penyebab_lengkap": "",
    "rekomendasi": ""
  },
  "030_helicoverpa_caterpillar": {
    "id": 30,
    "nama": "Helicoverpa Caterpillar",
    "namaIlmiah": "Helicoverpa armigera",
    "jenis": "Insect",
    "definisi_singkat": "The larvae of the fall armyworm cause damage by feeding on all plant parts. Young larvae initially eat one side of the surface of the leaf tissue, leaving the opposite layer intact (window feeding). Seedlings can be fed upon up to the destruction of ...",
    "gejala_lengkap": "The larvae of the fall armyworm cause damage by feeding on all plant parts. Young larvae initially eat one side of the surface of the leaf tissue, leaving the opposite layer intact (window feeding). Seedlings can be fed upon up to the destruction of buds and growing points. Larger larvae leave a characteristic row of perforations and ragged margins on leaves, as well as lines of larval frass. They can also cut the base of the plant or attack the reproductive and young fruit. In the case of heavy infestation, fall armyworm larvae can cause extensive loss of leaves.",
    "penyebab_lengkap": "Eggs are laid in tight clusters of 100-300 on the undersides of the leaves, usually covered with scales. The larvae are light tan or green to nearly black, with stripes running along the flanks and a yellowish line along the back. The moth has white transparent hind wings and brown front wings mottled with lighter and darker marks. Each forewing has a noticeable whitish spot near the extreme tip. Diet and temperature determine the length of the different life cycle phases. Cool, wet springs followed by warm, humid weather favor the life cycle of the insect.",
    "rekomendasi": "Wasp parasitoids include Cotesia marginiventris, Chelonus texanus and C. remus. The most common parasitoid fly is Archytas marmoratus. Predators include ground beetles, spined soldier bugs, flower bugs, birds or rodents. Bio-insecticides containing neem extracts, Bacillus Thuringiensis or Baculoviru..."
  },
  "031_may_beetles": {
    "id": 31,
    "nama": "May Beetles",
    "namaIlmiah": "Phyllophaga spp.",
    "jenis": "Insect",
    "definisi_singkat": "Clusters of yellow, elongated beetles with black spots on flowers and maize heads. Damage to seeds or germinating maize seedlings and reduction of plant stand. This insect is actually considered an efficient pollinator as its flight range can occasio...",
    "gejala_lengkap": "Clusters of yellow, elongated beetles with black spots on flowers and maize heads. Damage to seeds or germinating maize seedlings and reduction of plant stand. This insect is actually considered an efficient pollinator as its flight range can occasionally reach up to 200 m or even more. Only when conditions are favorable may it develop into a pest (warm, dry weather and temperature above 15°C). Even in these conditions, they do not usually cause sufficient damage to justify control with insecticides.",
    "penyebab_lengkap": "The damage is caused by the spotted maize beetle, Astylus atromaculatus. Adult beetles are slightly elongated, and have yellow wing covers with black spots. They are mainly herbivorous and feed on silk, pollen or grains from crops such as maize, rice, sorghum or sunflower. They usually do not cause much damage to these plants. When there are too few crops in the field, the beetles gather gregariously in grasses and can be a problem if they are ingested by cattle, with a possibility of causing deaths. Females lay the eggs under dry leaves. Larvae live in the ground and feed on decaying plant debris. They can also sometimes cause damage to seeds or germinating maize seedlings, thus reducing plant stand. Periods of warm, dry weather (above 15°C) favors their life cycle.",
    "rekomendasi": "Habitat management with known predators (cereal stemborers) together with a plant push-pull system (consisting of an intercropping with Desmodium and a barrier with Napier grass) has worked well in the past to deter this occasional pest from feeding on crops. Always consider an integrated approach w..."
  },
  "032_violet_stem_borer": {
    "id": 32,
    "nama": "Violet Stem Borer",
    "namaIlmiah": "Sesamia inferens",
    "jenis": "Insect",
    "definisi_singkat": "Symptoms may vary depending on environmental condition and the severity of the disease. Infected plants are easily detected for their abnormal height, either elongated or stunted and pale appearance. Seeds show lesions, rot and distortion. Stems show...",
    "gejala_lengkap": "Symptoms may vary depending on environmental condition and the severity of the disease. Infected plants are easily detected for their abnormal height, either elongated or stunted and pale appearance. Seeds show lesions, rot and distortion. Stems show discoloration of bark, mouldy growth, stunting or rosetting. Leaves show abnormal colors and fungal growth. The heads are affected by black or brown lesions, scabs and ear rot. The whole plant damps off and there is early senescence and seedling blight.",
    "penyebab_lengkap": "The disease is caused by the soil borne fungus Gibberella fujikuroi. The pathogen spores are dispersed by wind and rain and enter the maize ears through wounds. Plants are affected from seed germination on towards tassle emergence but symptoms are visible at later stages. It survives on seeds, crop residues or on alternative hosts such as grasses. It Spreads via spore infection through silks, roots and stalks. It enters the corn ears primarily through wounds from feeding damage from insects. It germinates and gradually colonizes the kernels from the entry points. Alternatively, it can start to colonize the plant from the roots and move up the plant through systemic growth. Plants can get infected under a wide range of environmental (stress) conditions, but the symptoms become particularly severe when the weather is warm (26-28°C) and moist and the plants have reached the flowering stage.",
    "rekomendasi": "To control the insects that transmit the pathogen spray neem extracts. Introduce bio control agents such as Trichoderma spp. to suppress the pathogen. Pseudomonas fleurosense is also effective in controlling Stalk Rot. Both of those ingredients can be used as a seed treatment as well as a soil appli..."
  },
  "033_root_and_foot_rot": {
    "id": 33,
    "nama": "Root and Foot Rot",
    "namaIlmiah": "Cochliobolus sativus",
    "jenis": "Fungus",
    "definisi_singkat": "Symptoms vary slightly depending on the hardiness of the pathogen, the degree of susceptibility of the plant, and on environmental conditions. First symptoms usually appear in late stages of plant growth, either during the emergence of silk threads o...",
    "gejala_lengkap": "Symptoms vary slightly depending on the hardiness of the pathogen, the degree of susceptibility of the plant, and on environmental conditions. First symptoms usually appear in late stages of plant growth, either during the emergence of silk threads or at full maturity. Elongated to oval or circular light-brown lesions appear on the lower leaves, often surrounded by a dark margin. The length and width of the lesions depend on the strength of the pathogen and the type of plant used. In some cases, these lesions may also occur on leaf sheaths and husks covering the ear. Black mold is sometimes visible on the kernels.",
    "penyebab_lengkap": "Northern leaf spot of maize is caused by the fungus Helminthosporium carbonum, which overwinters on corn residues in the soil. The spores on these debris serve as primary source of infection during wet weather. Secondary infection from plant to plant is wind- or rain-driven. The disease develops mainly on plants used in seed production and is therefore rarely a problem in the fields, where mostly resistant hybrids are grown. The progression of the disease is favored by moderate temperatures, humid weather, and minimal tillage of the field after harvest. If it occurs during the the grain filling phase, it can result in yield losses of 30 percent of more.",
    "rekomendasi": "Most treatments named here have only been used in small scales. Essential oil from Indian bael (Aegle marmelos) is active against Helminthosporium carbonum, at least in laboratory tests. Different compounds isolated from leaf extracts of some maize varieties (resistant and susceptible alike) can be ..."
  },
  "034_verticillium_wilt": {
    "id": 34,
    "nama": "Verticillium Wilt",
    "namaIlmiah": "Verticillium spp.",
    "jenis": "Fungus",
    "definisi_singkat": "You will see small, brown to grey bugs with flat bodies and sharp shoulders sticking out behind their heads. These insects are feeding by sucking on younger rice grains and leaves. This feeding creates small, dark spots especially on the grains. Thes...",
    "gejala_lengkap": "You will see small, brown to grey bugs with flat bodies and sharp shoulders sticking out behind their heads. These insects are feeding by sucking on younger rice grains and leaves. This feeding creates small, dark spots especially on the grains. These spots can affect the appearance and quality of the rice.",
    "penyebab_lengkap": "The slender rice bug attacks rice and other crops, such as soybeans. The females lay the eggs one by one on the leaves of rice. The first young bugs hatch in about 7 days. They grow through five stages before they turn into adult bugs. Younger generation are smaller than adults but look alike to the adults. When the winter is warm, more of these bugs survive. So, in years with warm winters, you might see more of them.",
    "rekomendasi": "Insecticidal soap or botanicals, such as neem oil or pyrethrin, may provide some control of young nymphs mainly. Leaf-footed bugs, such as the Slender rice bug, have many natural predators, including birds, spiders, and insects that prey on and parasitize them. To help control leaf-footed bugs, you ..."
  },
  "035_black_cutworm": {
    "id": 35,
    "nama": "Black Cutworm",
    "namaIlmiah": "Agrotis ipsilon",
    "jenis": "Insect",
    "definisi_singkat": "Symptoms differ depending on the plant type and the hunger of the grasshopper. Grasshopper and locust feed primarily on leaves damaging the margins or cutting out large portions of the leaf. Grains, seed pods and fruits may also be attacked by the in...",
    "gejala_lengkap": "Symptoms differ depending on the plant type and the hunger of the grasshopper. Grasshopper and locust feed primarily on leaves damaging the margins or cutting out large portions of the leaf. Grains, seed pods and fruits may also be attacked by the insect. When they are very hungry they might even feed on stems and bark. They also nibble at the shoots, hence severing the reproductive parts.",
    "penyebab_lengkap": "The characteristic symptoms on leafs and panicles are caused by the nymphs and adults. Aquatic environments are suitable for their development (e.g. rice fields, floodplains, deltas). The grasshoppers range in sizes from 5 mm to 11 cm in length, and they could either be long and slender or short and stout. They can blend easily into their surroundings as they are either green or straw colored. Females lay yellow eggs on the foliage. The adults can develop wings, swarm and migrate.",
    "rekomendasi": "Biological control agents which occur naturally such as wasps, parasitic flies and worms, ants, birds, frogs, web-spinning spiders should be promoted. Fungal pathogens and entomopathogenic fungus (Metarhizium acridum) could also be used to reduce the population density of larvae. Use home-made poiso..."
  },
  "036_zonate_leaf_spot": {
    "id": 36,
    "nama": "Zonate Leaf Spot",
    "namaIlmiah": "Microdochium sorghi",
    "jenis": "Fungus",
    "definisi_singkat": "This beetle has a strong affinity for cereals such as oats, barley, and rye, but its favorite host is wheat. It also has a variety of alternate hosts, such as corn, sorghum, and grasses. The larvae feed on the upper epidermis of the leaves and cause ...",
    "gejala_lengkap": "This beetle has a strong affinity for cereals such as oats, barley, and rye, but its favorite host is wheat. It also has a variety of alternate hosts, such as corn, sorghum, and grasses. The larvae feed on the upper epidermis of the leaves and cause the main damage of the entire life cycle. Their feeding habit is characterized by the removal of the leaf tissues down to the lower cuticle, leaving thin, long, white scars or streaks that can be numerous in case of infestation. However, the adult beetles usually migrate to other plants or fields as they feed, meaning that severe damage to a single field is rare. From the distance, an affected field may look weathered and old, but usually damage does not exceed 40% of the total area. The beetle can be a significant and perennial crop pest in some cereal-growing regions.",
    "penyebab_lengkap": "The damage is mainly caused by the larvae of the beetle Oulema melanopus. Adults are about 5 mm long and have dark-blue wing covers with a red head and legs. They spread to the exterior of the field and spend their overwintering time in protected areas such as wind rows, crop stubble, and tree bark crevices. They emerge when the environmental conditions improve during spring, at temperatures around 10 °C. Warm springs are favorable for its life cycle, while cold periods hinder it. After mating, the females start to lay bright yellow, cylindrical eggs on the underside of leaves, often along the midvein, and continue to do so over an extended period (45-60 days). The larvae hatch after 7-15 days and start feeding on the upper epidermis of the leaves, causing the worst damage. They are white or yellow, hump-backed, and have a black head and six small legs. As they reach maturation after 2-3 weeks of feeding, they pupate and give rise to the adult beetles in 20-25 days, starting the cycle again.",
    "rekomendasi": "Some species of nematodes of the genus Steinernema have been shown to attack the adults that overwinter in the soil, preventing them from reproducing in the spring. However, their efficiency can vary depending on the temperature. Some ladybugs also predate on eggs and larvae. The tachinid fly Hyalom..."
  },
  "037_late_wilt_of_maize": {
    "id": 37,
    "nama": "Late Wilt of Maize",
    "namaIlmiah": "Magnaporthiopsis maydis",
    "jenis": "Fungus",
    "definisi_singkat": "Zinc deficiency symptoms vary between species but several effects can be generalised. Many species show yellowing of leaves, often with main leaf veins remaining green. In some species, young leaves are the most affected, but in others both old and n...",
    "gejala_lengkap": "Zinc deficiency symptoms vary between species but several effects can be generalised. Many species show yellowing of leaves, often with main leaf veins remaining green. In some species, young leaves are the most affected, but in others both old and new leaves show the symptoms. New leaves are often smaller and narrower and have wavy margins. Over time, the yellow (chlorotic) spots can turn a bronze colour and dead (necrotic) spots may start to develop from the margins. In some crops, zinc-deficient leaves often have shortened internodes, so leaves are clustered on the stem (rosetting). Leaf deformation and reduced growth may occur, caused by restricted development of new leaves (dwarf leaves) and reduced internode length.",
    "penyebab_lengkap": "Zinc deficiency is mainly a problem in alkaline (high pH) sandy soils that are low in organic matter. High levels of soil phosphorus and calcium (calcareous soils) also affect the availability of zinc to plants. In fact, phosphorus application can show negative effects on zinc uptake. The addition of calcium-rich materials such as limestone or chalk (liming) also offsets soil acidity and reduces the uptake of zinc by the plants (even though the levels in the soil remain unchanged). Zinc deficiency can also become a problem when soils are cool and wet during the vegetative phase.",
    "rekomendasi": "Application of organic manure to the seedbed or field a few days after transplanting helps to reduce the chance of zinc deficiency occurring. Use a fertiliser containing zinc (Zn).\nExample: Zinc sulphate (ZnSO4) is commonly used for foliar sprays.\nConsult your agricultural advisor to know the best p..."
  },
  "038_charcoal_stalk_rot": {
    "id": 38,
    "nama": "Charcoal Stalk Rot",
    "namaIlmiah": "Macrophomina phaseolina",
    "jenis": "Fungus",
    "definisi_singkat": "Damping-off can occur in two phases during seedling development, during pre-emergence or post-emergence. In the pre-emergence phase, the fungus colonizes the seeds just after sowing, causing seed rot and stopping germination. In the post-emergence ph...",
    "gejala_lengkap": "Damping-off can occur in two phases during seedling development, during pre-emergence or post-emergence. In the pre-emergence phase, the fungus colonizes the seeds just after sowing, causing seed rot and stopping germination. In the post-emergence phase, seedlings grow poorly and the base of the stem starts to rot. The stem is visible as soft and slimy with water-soaked, grey, brown or black lesions. Young plants or trees become chlorotic and start to wilt, eventually toppling down, appearing as if they have been cut off at the base. White or grey mold-like growth appears on dead plants or on the soil surface. When seedling loss is extensive, replanting may be necessary.",
    "penyebab_lengkap": "Damping-off can affect several crops and is caused by fungi of the genus Pythium, which can survive for several years in soil or plant residues. They thrive when weather is warm and rainy, soils are excessively moist and plants are densely sown. Stressful conditions, such as water-logging or high nitrogen application, weaken the plants and also favor the development of the disease. Spores are disseminated via contaminated tools or equipment and mud on clothes or shoes. Event though they can attack crops during their whole life cycle, germinating seeds or young seedlings are more susceptible. The disease is not necessarily carried over from one season to another in the same place, but rather appears when and where conditions favor infection.",
    "rekomendasi": "Biofungicides based on fungi Trichoderma viride, Beauveria bassiana or the bacteria Pseudomonas fluorescens and Bacillus subtilis can be used as seed treatment or applied around the root zone at the time of planting to prevent or control the pre-emergence form of damping off. In some cases, the prev..."
  },
  "039_bacterial_leaf_streak_of_maize": {
    "id": 39,
    "nama": "Bacterial Leaf Streak of Maize",
    "namaIlmiah": "Xanthomonas vasicola pv. vasculorum",
    "jenis": "Bacteria",
    "definisi_singkat": "Caterpillars of Elasmopalpus lignosellus can feed on maize leaves but the bulk of the damage is done when they tunnel into the base of stalks and stems, usually during the late seedling stage. They eat the stems' inner tissues which is replaced by ab...",
    "gejala_lengkap": "Caterpillars of Elasmopalpus lignosellus can feed on maize leaves but the bulk of the damage is done when they tunnel into the base of stalks and stems, usually during the late seedling stage. They eat the stems' inner tissues which is replaced by abundant larval frass visible around the entry points. This group of symptoms is commonly known as dead heart. Plants are usually deformed, and show a stunted growth with few ears. Impaired water and nutrient transport leads to wilting and whithering of the plants, as well as lodging or death in some cases. Lesser cornstalk borers are adapted for hot, dry conditions, and are more damaging following unusually warm, dry weather.",
    "penyebab_lengkap": "The moths vary in color depending on regional and environmental factors. The males' forewings are brownish-yellow with scattered dark spots that are tighly-packed near the margins, where a broad darker brown band is found. The females' front wings are charcoal black, with reddish or purplish scales. The hindwings of both sexes are transparent with a silvery tinge. Females lay greenish eggs below the dry soil surface, or at the base of stems. The larvae are thin and hairy, with striated alternate purple and whitish bands encircling the body. They wiggle violently when disturbed. They dwell in tubes or tunnels made of silken webbing just below the surface of the soil and come out to feed on roots and plant tissues. Dry years or well-drained sandy soils are particularly beneficial for the pest. Irrigating the crop at 80% of field capacity actually helps to control the population.",
    "rekomendasi": "There are many predatory enemies, but the larvae's well protected habitat inside the stems and stalks makes an effective control difficult. In some cases, the parasitoid braconid wasps Orgilus elasmopalpi and Chelonus elasmopalpi can change the dynamics of the population. The use of bio-insecticides..."
  },
  "040_sugarcane_mosaic_virus": {
    "id": 40,
    "nama": "Sugarcane Mosaic Virus",
    "namaIlmiah": "SCMV",
    "jenis": "Virus",
    "definisi_singkat": "Initial symptoms are characterized by a darkening and wilting of flowers, flower buds or growing points (blossom blight). The disease then spreads downward, producing water-soaked lesions on leaves, giving them a silvery tinge. Older lesions turn nec...",
    "gejala_lengkap": "Initial symptoms are characterized by a darkening and wilting of flowers, flower buds or growing points (blossom blight). The disease then spreads downward, producing water-soaked lesions on leaves, giving them a silvery tinge. Older lesions turn necrotic and appear dried out, resulting in blighted leaf tips and margins. On stems, signs of rot are visible in the form of brown to black patches and die-back. Eventually, the whole plant may wilt. Black soft rot can also develop on young fruits, usually at the blossom end. A close inspection will reveal silvery, hair-like growth on all infected tissues. In seedlings, symptoms may be confused with Phytophthora blight.",
    "penyebab_lengkap": "The symptoms are caused by Choanephora cucurbitarum, an opportunistic fungus that mainly attacks tissues that have been damaged by insects or mechanical means during fieldwork. Its spores are generally spread via wind, splashing water, and through clothes when in contact with tools and cultivation equipment. Outbreaks of the disease usually occur during prolonged rainy periods, high humidity and high temperatures. Not surprisingly, it causes the greatest damage to pepper and okra grown during the rainy season in tropical climates. Crop poorly adapted to these conditions will be particularly susceptible. In order to tell the difference with Phythophtora blight, observe tissues for the presence of grayish hairs (rather in the morning).",
    "rekomendasi": "There is no biological treatment available for this disease. In Benin, the bacterium Bacillus subtilis has been tested positively in some crops for its antagonist effect against Choanephora cucurbitarum. However, no test on peppers has been carried out. Always consider an integrated approach with pr..."
  },
  "041_maize_leaf_streak_virus": {
    "id": 41,
    "nama": "Maize Leaf Streak Virus",
    "namaIlmiah": "MSV",
    "jenis": "Virus",
    "definisi_singkat": "Whitish to brown eggs can be found in clusters around floral structures and young leaves on upper canopy. Feeding damage can be found on any plant tissue but are most likely on flowers and bolls/ears/fruits/pods, depending on the host plant. Young la...",
    "gejala_lengkap": "Whitish to brown eggs can be found in clusters around floral structures and young leaves on upper canopy. Feeding damage can be found on any plant tissue but are most likely on flowers and bolls/ears/fruits/pods, depending on the host plant. Young larvae scrape the foliage, growing points or the fruiting structure, causing little damage. Older ones bore into flowers or the young boll/ear/fruit/pod, hollowing it from the inside, damaging seeds and making it unfit for marketing. Frass is visible around the feeding holes. The growth of secondary pathogens on the wounds lead to the rotting of the affected tissues.",
    "penyebab_lengkap": "The damage is caused by the caterpillar of Helicoverpa armigera, a common pest in a number of crops. H. armigera one of the most destructive pests in agriculture. Moths are light brown, with a wingspan of 3-4 cm. They generally have yellow to orange or brown forewings mottled with darker patterns. Hindwings are whitish, with dark veins and dark elongated spots on the lower edges. Females lay spherical, whitish eggs singly or in clusters on flowers or leaf surfaces, mainly on the top canopy. The larvae are olive green to dark reddish-brown, depending on the maturation stage. Their body is speckled with little black spots and they have a dark head. At later maturity stages, lines and bands develop along their back and flanks. As they reach maturity, they pupate in the soil. The population normally peaks during fruit/pod/boll development, which results in high yield loss.",
    "rekomendasi": "Trichogramma wasps (T. chilonis or T. brasiliensis) can be introduced coinciding with flower initiation to attack the eggs. Microplitis, Heteropelma and Netelia wasps parasitize the larvae. Predatory bugs (big-eyed bug, glossy shield bug and spined predatory shield bug), ants, spiders, earwigs, cric..."
  },
  "042_thrips": {
    "id": 42,
    "nama": "Thrips",
    "namaIlmiah": "Thysanoptera",
    "jenis": "Insect",
    "definisi_singkat": "May beetles cut main roots or chew off fine root of mature plants. This hinders the uptake of water and nutrients, which usually results in stunted, wilted, and discolored canopy. Emerging seedlings can also be attacked, resulting in patches of wilte...",
    "gejala_lengkap": "May beetles cut main roots or chew off fine root of mature plants. This hinders the uptake of water and nutrients, which usually results in stunted, wilted, and discolored canopy. Emerging seedlings can also be attacked, resulting in patches of wilted growth in the field or simply gaps in the rows. Typically, the stem of the injured plants turns purple, indicating phosphorus deficiency. Cool, wet soils will exacerbate the situation because the growth of corn seedlings will be slowed and remain susceptible for a longer time.",
    "penyebab_lengkap": "The damage is caused by the larvae of several beetles belonging to the genus Phyllophaga (over 100 different species). Other types of beetles may be involved and therefore, it is important to learn how to recognize them. The beetles are about 12 to 25 mm long, yellow to reddish-brown or black, robust, and with an oblong shape. Larvae are whitish with a brown head and C-shaped, 20 to 45 mm in length and with three pairs of legs. The hind portion of the abdomen is dark and slightly enlarged because of the soil particles showing through the body wall. The life cycle of these insect can vary widely and this makes preventive control measures essential to keep populations in check.",
    "rekomendasi": "Natural enemies that control white grubs include parasitic wasps in the genera Tiphia and Myzinum, and the species Pelecinus polyturator. Parasitic flies include the species Pyrgota undata. The fungi in the genus Cordyceps also infect the larvae and can be used in solutions to control their populati..."
  },
  "043_holcus_leaf_spot": {
    "id": 43,
    "nama": "Holcus Leaf Spot",
    "namaIlmiah": "Pseudomonas syringae pv. syringae",
    "jenis": "Bacteria",
    "definisi_singkat": "The damage to crops is principally through the feeding activity of the caterpillars. They bore into the stems or the base of the panicle and feed on the internal substance, blocking the transport of nutrients and water. Exit holes of the caterpillar ...",
    "gejala_lengkap": "The damage to crops is principally through the feeding activity of the caterpillars. They bore into the stems or the base of the panicle and feed on the internal substance, blocking the transport of nutrients and water. Exit holes of the caterpillar can also be observed on stems and panicles. The lack of supplies causes wilt of the affected plant parts. When opened longitudinally, the stems show ‘dead hearts’ symptoms, with the presence of larvae and frass inside.",
    "penyebab_lengkap": "Symptoms are caused by the purple stem borer, Sesamia inferens. Larvae overwinter as pupae inside stems or plant debris in the soils and emerge as adults during the spring, when weather conditions are benign. The moths are small, stout and light brown with a hairy head and body. Forewings are straw colored with a marked golden margin. Hindwings are translucent white with yellowish veins. Females lay clusters of rounded, pale and yellowish green eggs in several rows behind the leaf sheaths to protect them from predators. Caterpillars are about 20 to 25 mm long, pinkish in color, with red-brown heads and no stripes. They bore into the stem and feed on the internal tissues.",
    "rekomendasi": "Several parasitoid wasps of the groups Telenomeus and Trichogramma are depositing their eggs into the eggs of Sesamia inferens and help to control the population. For example, the release of egg parasitoid, Trichogramma chilonis (8 cards per hectare) at 12 and 22 days after germination. The larvae a..."
  },
  "044_goss_wilt": {
    "id": 44,
    "nama": "Goss Wilt",
    "namaIlmiah": "Clavibacter michiganensis",
    "jenis": "Bacteria",
    "definisi_singkat": "Symptoms will depend on the environmental conditions and the plant growth stage. In some cases, contaminated seeds can give rise to seedling blight, which is characterized by the appearance of dark brown areas on young plants. Early infection of matu...",
    "gejala_lengkap": "Symptoms will depend on the environmental conditions and the plant growth stage. In some cases, contaminated seeds can give rise to seedling blight, which is characterized by the appearance of dark brown areas on young plants. Early infection of mature plants may not produce symptoms, except for a decrease in leaf area and number of tillers. However, dark-brown areas may be present at the base of the stem (foot rot) or below ground, and on internodes and roots (root rot). Later on, as the pathogen progresses into the stem, elongated, brown-black spots appear on lower leaves. This is particularly evident during prolonged periods of rain. Diseased plants occur randomly or in irregular patches, and are stunted and often chlorotic. A common symptom of late infections is the premature bleaching of one or more spikelets or the entire head (head blight).",
    "penyebab_lengkap": "The symptoms are caused by the fungi Cochliobolus sativus, which is common in warm and humid cereal-growing areas. It survives as mycelium or spores in soil and crop debris, and is spread by wind, rain splashes or irrigation water onto healthy plants. Beside barley, wheat and rye, it can also infect a number of species of weeds and grasses. Oat is resistant to the disease but can still contribute to the dispersal of the pathogen. When a susceptible host is found and conditions are favorable, its spores germinate and initiate a primary infection on the young plant or its roots. It penetrates plant tissues either directly through the epidermis or via natural pores or wounds. Infested seed or agricultural tools can also disseminate the pathogen over long distances and serve as inoculum for subsequent crops. The life cycle of the fungus is favored by warm temperatures (optimal 28-32ºC).",
    "rekomendasi": "The fungus of Sporobolomyces roseus is a natural enemy of Cochliobolus sativus and has been used in cereals to reduce the incidence and severity of the disease. Other antagonists of this pathogen are also available. Always consider an integrated approach of both preventive measures and biological tr..."
  },
  "045_manganese_deficiency": {
    "id": 45,
    "nama": "Manganese Deficiency",
    "namaIlmiah": "Manganese Deficiency",
    "jenis": "Deficiency",
    "definisi_singkat": "Symptoms vary greatly between the different crops. Usually, yellowing appears first on the margins of older leaves. As the yellowing extends to the rest of the tissue, the leaf takes a wilted aspect, often only on one side. This particular trait is c...",
    "gejala_lengkap": "Symptoms vary greatly between the different crops. Usually, yellowing appears first on the margins of older leaves. As the yellowing extends to the rest of the tissue, the leaf takes a wilted aspect, often only on one side. This particular trait is called sectoral chlorosis or \"one-sided wilt\". On the stem black stripes develop and extend from the base upwards, leading to the wilting of stems. In trees, poor growth, early leaf senescence, stunting and death of whole branches are the main symptoms. Staining of woody tissues in the form of circular rings or streaks may be additional symptoms. Sometimes, at closer inspection with a lens, small black dots are visible in the dying tissue or on living tissue as well.",
    "penyebab_lengkap": "The symptoms are caused by a series of soil-borne fungi, among others V. dahliae, which can survive on crop debris in the soil when no host is available. It enters the vascular tissue of the plant through the rootlets or wounds in the bark. Once inside the plant or the tree, it grows rapidly and blocks the transport of water and nutrients, resulting in the wilting and decay of the aerial parts (leaves and stems). This is intensified by warm sunny weather. At later stages of the disease, the fungus colonizes the dying tissue and forms dark structures that can be observed with a magnifying lens. The fungus can survive several years at a location.",
    "rekomendasi": "Biofungicides containing Streptomyces lydicus break the life cycle of the fungus and can help to control the progression of the disease. Always consider an integrated approach with preventive measures together with biological treatments if available. When the trees are affected by the disease it is ..."
  },
  "046_magnesium_deficiency": {
    "id": 46,
    "nama": "Magnesium Deficiency",
    "namaIlmiah": "Magnesium Deficiency",
    "jenis": "Deficiency",
    "definisi_singkat": "The larvae damage shoots and capsules by boring into them, often webbing capsules together. They create silk-lined tunnels with frass inside. Sometimes, they are found where the leaf joins the stem or rarely in the middle of thick leaves. Signs of da...",
    "gejala_lengkap": "The larvae damage shoots and capsules by boring into them, often webbing capsules together. They create silk-lined tunnels with frass inside. Sometimes, they are found where the leaf joins the stem or rarely in the middle of thick leaves. Signs of damage include frass on damaged shoots and webbed capsules.",
    "penyebab_lengkap": "Damage is caused by the larva, which bores into stems, shoots, buds, fruits, and seeds. This damage can lead to infections. Females lay small, oval, light yellow eggs on or near fruits or seeds. After 6-7 days, the eggs turn dark brown. The adult is medium-sized with pale yellow wings and small black dots. The larvae feed on seeds, capsules, and young shoots. Fully grown larvae are 24 mm long, pale green with a pink tint, fine hairs, a dark head, and a shield. They pupate in the stem or capsule.",
    "rekomendasi": "Plant trap crops to divert borer away from the main crops. Introduce natural enemies. Always consider an integrated approach with preventive measures together with biological treatments if available. It is difficult to control the larvae with chemical treatments because they can bore into fruits. Wh..."
  },
  "047_sulfur_deficiency": {
    "id": 47,
    "nama": "Sulfur Deficiency",
    "namaIlmiah": "Sulfur Deficiency",
    "jenis": "Deficiency",
    "definisi_singkat": "Symptoms will vary widely depending on the crop. Larvae tunnel into and feed on buds, blossoms and tender terminal foliar growth, causing damage to growing tissues. Other plant organs such as leaves, petioles and stalks may be attacked if no reproduc...",
    "gejala_lengkap": "Symptoms will vary widely depending on the crop. Larvae tunnel into and feed on buds, blossoms and tender terminal foliar growth, causing damage to growing tissues. Other plant organs such as leaves, petioles and stalks may be attacked if no reproductive tissue is available. Attacked buds become yellow and may abort from the plant. In cotton and legumes, holes and moist frass may be seen at the base of bolls and pods. Gouges resulting from the superficial feeding of caterpillars are also common. In some instances, the 'fruits' are emptied from the inside and they may start to rot. In cotton, the pattern of damage and level of injury resemble that caused by corn earworm.",
    "penyebab_lengkap": "Damage is cause by the tobacco budworm, Chloridea virescens. It is an important pest in several crops, among others soybean and cotton (generally in desert areas). The moths are brownish in color (wings inclusive), sometimes lightly tinged with green. The front wings are crossed transversely by three dark brown bands, sometimes with a whitish or cream-colored border. The hindwings are whitish, with a dark band along the margins. Females lay spherical, flattened eggs on blossoms, fruits and terminal growth. Mature larvae are the most destructive because they can damage more blossoms and fruits, and can also damage them until later in the season (harder for the plant to replace). Moths can live up to 25 days when held at temperatures of about 20°C.",
    "rekomendasi": "Natural enemies like wasps (Polistes spp.), bigeye bugs, damsel bugs, minute pirate bugs (Orius spp.) and spiders should be promoted. Parasitoids include Trichogramma pretiosum and Cardiochiles nigriceps in vegetables and Cotesia marginiventris in other crop groups. Other parasitoids that may be use..."
  },
  "048_wireworms": {
    "id": 48,
    "nama": "Wireworms",
    "namaIlmiah": "Elateridae",
    "jenis": "Insect",
    "definisi_singkat": "Cutworms attack a wide range of crops at all growth stages, but young seedlings are preferred. The damage can be severe if high numbers of caterpillars coincides with the emergence of seedlings and weedy field surroundings. Young caterpillars forage ...",
    "gejala_lengkap": "Cutworms attack a wide range of crops at all growth stages, but young seedlings are preferred. The damage can be severe if high numbers of caterpillars coincides with the emergence of seedlings and weedy field surroundings. Young caterpillars forage near the ground on weeds or maize if present, leaving small irregular holes on tender leaves. Their older counterparts are burrowed in the soil to avoid the daylight and emerge at night to feed at the base of the plants. Young plants can be dragged underground. Stems can be severed (‘cut’ ) at ground level, resulting in damage to the growing tissues, impaired growth or death. The cutworms can also burrow into the stem which can result in wilting and lodging of older plants.",
    "penyebab_lengkap": "Black cutworms are robust moths with a grayish brown mottled body. They have light-brown and dark-brown forewings with darker markings toward the outer edge, and white hindwings. They are nocturnal and hide in the soil during the day. Females look similar to males but somewhat darker. They lay pearly white (later light brown) eggs singly or in clusters on plants, on moist ground or in cracks in the soil. The hatching of the larvae depends greatly on temperature and can take from 3 to 24 days (at 30°C and 12°C respectively). Young larvae are light gray, smooth and greasy in appearance, and 5 to 10 mm in length. Older larvae are dark-brown, up to 40 mm long, with two yellow dotted strips running down the back. They feed during the night and during the day and they can be found curled up into a C shape in small shallow tunnels below the soil surface.",
    "rekomendasi": "Cutworms have many enemies including parasitic wasps, flies and predators such as grasshoppers. Bio-insecticides based on Bacillus thuringiensis, Nucleopolyhedrosis virus and Beauveria bassiana provide effective population control. Natural predators should be encouraged by avoiding unnecessary treat..."
  },
  "049_internode_borer": {
    "id": 49,
    "nama": "Internode Borer",
    "namaIlmiah": "Chilo sacchariphagus indicus",
    "jenis": "Insect",
    "definisi_singkat": "The symptoms characteristic for this disease appear on leaves, leaf sheaths and panicles. On leaves, reddish brown and water-soaked spots develop, occasionally with a narrow, pale-green halo. As they increase in size, they develop into lesions with a...",
    "gejala_lengkap": "The symptoms characteristic for this disease appear on leaves, leaf sheaths and panicles. On leaves, reddish brown and water-soaked spots develop, occasionally with a narrow, pale-green halo. As they increase in size, they develop into lesions with a light-brown center surrounded by a reddish border. They are semicircular if they occur along the leaf margin or circular near the midrib. A characteristic alternate or zonate patter of light and dark rings is clearly visible. Eventually, the lesions join to engulf the whole leaf when the infection is severe. On leaf sheaths, dark-red to blackish-purple or brown lesions of varying length, shape and size appear. Infected leaf sheaths become yellow, wither and die. Numerous fungal bodies (sclerotia) may be observed in the necrotic lesions. Infected panicles become blighted.",
    "penyebab_lengkap": "The symptoms are caused by the fungus Gloeocercospora sorghi, which can survive on seeds or on the soil for several years. The fungal latent structures called sclerotia (small dark dots visible on the lesions) are the primary source of infection and can trigger epidemics when optimal conditions prevail, as for example warm and wet weather. The pathogen spreads from the soil onto old, lower leaves via water splashing or wind. In the conditions are favorable, the disease progresses up the plant and lesions may occur on all leaves. The pathogen triggering zonate leaf spot in sorghum may also infect other grass species including corn and millet. These other hosts may serve as a reservoir of inoculum for the following seasons.",
    "rekomendasi": "No biological control measures seem to be available against this pathogen. Please contact us if you know of any method that can help to reduce the incidence or severity of the disease. Always consider an integrated approach with preventive measures together with biological treatments if available. C..."
  },
  "050_mediterranean_brocade_moth": {
    "id": 50,
    "nama": "Mediterranean Brocade Moth",
    "namaIlmiah": "Spodoptera littoralis",
    "jenis": "Insect",
    "definisi_singkat": "Symptoms are usually observed during or after the flowering stage and vary in intensity depending on the variety of maize and weather conditions. Leaves in the lower part of the plants start to wilt and turn dull green. Gradually, they become dry and...",
    "gejala_lengkap": "Symptoms are usually observed during or after the flowering stage and vary in intensity depending on the variety of maize and weather conditions. Leaves in the lower part of the plants start to wilt and turn dull green. Gradually, they become dry and start to roll inwards, while the symptoms progress upward. Ears of affected plants do not grow properly, husks may have lesions and grains development is impaired. In some cases, yellowish to purple or dark brown streaks are visible at the base of the stalks. Part of the vascular tissue and the internodes turn reddish-brown, something that is clearly visible in a cross-section of the stalk. Eventually they become dry, shrunken, and hollow.",
    "penyebab_lengkap": "The symptoms are caused by Magnaporthiopsis maydis, a fungus that overwinters in the soil and potentially also on seeds. The soil- or seedborne spores infect the roots of seedlings via small wounds and gradually colonize the tissues as they develop. In the vessels, they are translocated from the roots up the stalk and into the ear and grains. Optimal conditions for disease development are: constant temperature around 24 °C or natural temperature variations between 20 and 32 °C. Higher temperatures inhibit the growth of the fungus and less occurrence is observed at 36 °C, for example. This disease is economically important in several parts of the world.",
    "rekomendasi": "Several solutions based on microorganisms have been tested in laboratories to treat seeds and/or reduce the incidence of this pathogen: the fungi Trichurus spiralis, Streptomyces graminofaciens, S. gibsonii, S. lydicus, S. nogalater, S. rochei, S. annulatus and the yeasts Candida maltosa, C. glabrat..."
  }
}